package by.epam.tr.main;

public class PartTwoTask9 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 9. Вычислить значение выражения по формуле (все переменные принимают
		// действительные значения):
		double a = 2.0;
		double b = 2.0;
		double c = 2.0;
		double d = 2.0;
		double s = 0;

		System.out.println((a / c) * (b / d) - ((a * b - c) / (c * d)));

	}
}
