package by.epam.tr.main;

public class PartThreeTask5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 5. С помощью оператора while напишите программу определения суммы всех
		// нечетных чисел в
		// диапазоне от 1 до 99 включительно.

		int x = 1;

		while (x <= 99) {
			System.out.print(x + " ");
			x = x + 2;
		}
	}

}
